espressif/arduino-esp32/boards.txt
pico32.menu.DebugLevel.none=None
pico32.menu.DebugLevel.none.build.code_debug=0
pico32.menu.DebugLevel.error=Error
pico32.menu.DebugLevel.error.build.code_debug=1
pico32.menu.DebugLevel.warn=Warn
pico32.menu.DebugLevel.warn.build.code_debug=2
pico32.menu.DebugLevel.info=Info
pico32.menu.DebugLevel.info.build.code_debug=3
pico32.menu.DebugLevel.debug=Debug
pico32.menu.DebugLevel.debug.build.code_debug=4
pico32.menu.DebugLevel.verbose=Verbose
pico32.menu.DebugLevel.verbose.build.code_debug=5

##############################################################
tinypico.name=TinyPICO

tinypico.upload.tool=esptool_py
tinypico.upload.maximum_size=1310720
tinypico.upload.maximum_data_size=327680
tinypico.upload.wait_for_upload_port=true

tinypico.serial.disableDTR=true
tinypico.serial.disableRTS=true

tinypico.build.mcu=esp32
tinypico.build.core=esp32
tinypico.build.variant=pico32
tinypico.build.board=TINYPICO

tinypico.build.f_cpu=240000000L
tinypico.build.flash_size=4MB
tinypico.build.flash_freq=80m
tinypico.build.flash_mode=dio
tinypico.build.boot=dio
tinypico.build.partitions=default
tinypico.build.defines=

tinypico.menu.PartitionScheme.default=Default
tinypico.menu.PartitionScheme.default.build.partitions=default
tinypico.menu.PartitionScheme.no_ota=No OTA (Large APP)
tinypico.menu.PartitionScheme.no_ota.build.partitions=no_ota
tinypico.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
tinypico.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
tinypico.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
tinypico.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

tinypico.menu.UploadSpeed.921600=921600
tinypico.menu.UploadSpeed.921600.upload.speed=921600
tinypico.menu.UploadSpeed.115200=115200
tinypico.menu.UploadSpeed.115200.upload.speed=115200
tinypico.menu.UploadSpeed.256000.windows=256000
tinypico.menu.UploadSpeed.256000.upload.speed=256000
tinypico.menu.UploadSpeed.230400.windows.upload.speed=256000
tinypico.menu.UploadSpeed.230400=230400
tinypico.menu.UploadSpeed.230400.upload.speed=230400
tinypico.menu.UploadSpeed.460800.linux=460800
tinypico.menu.UploadSpeed.460800.macosx=460800
tinypico.menu.UploadSpeed.460800.upload.speed=460800
tinypico.menu.UploadSpeed.512000.windows=512000
tinypico.menu.UploadSpeed.512000.upload.speed=512000

tinypico.menu.FlashMode.qio=QIO
tinypico.menu.FlashMode.qio.build.flash_mode=dio
tinypico.menu.FlashMode.qio.build.boot=qio
tinypico.menu.FlashMode.dio=DIO
tinypico.menu.FlashMode.dio.build.flash_mode=dio
tinypico.menu.FlashMode.dio.build.boot=dio

tinypico.menu.FlashFreq.80=80MHz
tinypico.menu.FlashFreq.80.build.flash_freq=80m
tinypico.menu.FlashFreq.40=40MHz
tinypico.menu.FlashFreq.40.build.flash_freq=40m

tinypico.menu.PSRAM.enabled=Enabled
tinypico.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue
tinypico.menu.PSRAM.disabled=Disabled
tinypico.menu.PSRAM.disabled.build.defines=

tinypico.menu.DebugLevel.none=None
tinypico.menu.DebugLevel.none.build.code_debug=0
tinypico.menu.DebugLevel.error=Error
tinypico.menu.DebugLevel.error.build.code_debug=1
tinypico.menu.DebugLevel.warn=Warn
tinypico.menu.DebugLevel.warn.build.code_debug=2
tinypico.menu.DebugLevel.info=Info
tinypico.menu.DebugLevel.info.build.code_debug=3
tinypico.menu.DebugLevel.debug=Debug
tinypico.menu.DebugLevel.debug.build.code_debug=4
tinypico.menu.DebugLevel.verbose=Verbose
tinypico.menu.DebugLevel.verbose.build.code_debug=5

##############################################################
magicbit.name=MagicBit

magicbit.upload.tool=esptool_py
magicbit.upload.maximum_size=1310720
magicbit.upload.maximum_data_size=327680
magicbit.upload.wait_for_upload_port=true

magicbit.serial.disableDTR=true
magicbit.serial.disableRTS=true

magicbit.build.mcu=esp32
magicbit.build.core=esp32
magicbit.build.variant=magicbit
magicbit.build.board=ESP32_DEV

magicbit.build.f_cpu=240000000L
magicbit.build.flash_size=4MB
magicbit.build.flash_freq=40m
magicbit.build.flash_mode=dio
magicbit.build.boot=dio
magicbit.build.partitions=default

magicbit.menu.CPUFreq.240=240MHz (WiFi/BT)
magicbit.menu.CPUFreq.240.build.f_cpu=240000000L
magicbit.menu.CPUFreq.160=160MHz (WiFi/BT)
magicbit.menu.CPUFreq.160.build.f_cpu=160000000L
magicbit.menu.CPUFreq.80=80MHz (WiFi/BT)
magicbit.menu.CPUFreq.80.build.f_cpu=80000000L
magicbit.menu.CPUFreq.40=40MHz (40MHz XTAL)

magicbit.menu.UploadSpeed.921600=921600
magicbit.menu.UploadSpeed.921600.upload.speed=921600
magicbit.menu.UploadSpeed.115200=115200
magicbit.menu.UploadSpeed.115200.upload.speed=115200
##############################################################
turta_iot_node.name=Turta IoT Node

turta_iot_node.upload.tool=esptool_py
turta_iot_node.upload.maximum_size=1310720
turta_iot_node.upload.maximum_data_size=327680
turta_iot_node.upload.wait_for_upload_port=true

turta_iot_node.serial.disableDTR=true
turta_iot_node.serial.disableRTS=true

turta_iot_node.build.mcu=esp32
turta_iot_node.build.core=esp32
turta_iot_node.build.variant=pico32
turta_iot_node.build.board=ESP32_PICO

turta_iot_node.build.f_cpu=240000000L
turta_iot_node.build.flash_size=4MB
turta_iot_node.build.flash_freq=80m
turta_iot_node.build.flash_mode=dio
turta_iot_node.build.boot=dio
turta_iot_node.build.partitions=default
turta_iot_node.build.defines=

turta_iot_node.menu.UploadSpeed.921600=921600
turta_iot_node.menu.UploadSpeed.921600.upload.speed=921600
turta_iot_node.menu.UploadSpeed.115200=115200
turta_iot_node.menu.UploadSpeed.115200.upload.speed=115200

turta_iot_node.menu.DebugLevel.none=None
turta_iot_node.menu.DebugLevel.none.build.code_debug=0
turta_iot_node.menu.DebugLevel.error=Error
turta_iot_node.menu.DebugLevel.error.build.code_debug=1
turta_iot_node.menu.DebugLevel.warn=Warn
turta_iot_node.menu.DebugLevel.warn.build.code_debug=2
turta_iot_node.menu.DebugLevel.info=Info
turta_iot_node.menu.DebugLevel.info.build.code_debug=3
turta_iot_node.menu.DebugLevel.debug=Debug
turta_iot_node.menu.DebugLevel.debug.build.code_debug=4
turta_iot_node.menu.DebugLevel.verbose=Verbose
turta_iot_node.menu.DebugLevel.verbose.build.code_debug=5

